app/controllers/letters_controller.rb

	def index
		@letters = Letter.all
---
SELECT "letters".* FROM "letters"

	def show
  		@letter = Letter.find(params[:id])
---
SELECT  "letters".* FROM "letters" WHERE "letters"."id" = $1 LIMIT 1  [["id", 1]]

	def create
  		@letters = Letter.new(letter_params)
  		respond_to do |format|
  		if current_user.letters.push @letters
---
INSERT INTO "letters" ("reciever", "title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reciever", "something@gmail.com"], ["title", "aaaaaaaaa"], ["content", "aaaaaaa"], ["user_id", 1], ["created_at", "2015-06-05 22:08:21.539859"], ["updated_at", "2015-06-05 22:08:21.539859"]]

	def edit
  		@letter = Letter.find(params[:id])
---
SELECT  "letters".* FROM "letters" WHERE "letters"."id" = $1 LIMIT 1  [["id", 1]]

	def update
  		@letter = Letter.find(params[:id])

  		if @letter.update_attributes(letter_params)
---
SELECT  "letters".* FROM "letters" WHERE "letters"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "letters" SET "reciever" = $1, "title" = $2, "content" = $3, "updated_at" = $4 WHERE "letters"."id" = $5  [["reciever", "dad"], ["title", "Happy Father's Day"], ["content", "This is some content"], ["updated_at", "2015-06-08 12:38:08.035121"], ["id", 8]]

	def destroy
  		@letter = Letter.find(params[:id])
  		@letter.destroy
---
SELECT  "letters".* FROM "letters" WHERE "letters"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "letters" WHERE "letters"."id" = $1  [["id", 2]]